# RemoveSplitRegion Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..RemoveSplitRegion Method
ViewCropRegionShapeManager Class See Also
---
Removes one region in split crop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void RemoveSplitRegion(
	int regionIndex
)
```

Visual Basic
---
```text
Public Sub RemoveSplitRegion ( _
	regionIndex As Integer _
)
```

Visual C++
---
```text
public:
void RemoveSplitRegion(
	int regionIndex
)
```

# ### Parameters
regionIndex
    Type: System..::..Int32 Index of region to be deleted (numbering starts with 0).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The provided region index cannot be deleted. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The crop of the associated view is not permitted to have multiple regions. -or- The view has non-rectangular crop shape set. |

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace